app/services/mission_assignment_service.rb

  def self.assign(guest)
    return ServiceResult.fail("El invitado ya tiene una misión activa.") if guest.active_assignment.present?

    mission = find_valid_mission_for(guest)
    return ServiceResult.fail("No hay misiones disponibles para este invitado.") if mission.nil?

    assignment = MissionAssignment.create!(
      guest: guest,
      mission: mission,
      status: :assigned
    )
---
INSERT INTO "mission_assignments" ("assigned_at", "completed_at", "created_at", "guest_id", "mission_id", "status", "updated_at") VALUES ('2026-09-10 11:48:27.731185', NULL, '2026-09-10 11:48:27.731046', 2, 1, 0, '2026-09-10 11:48:27.731046') RETURNING "id"

  def self.assign_manual(guest, mission)
    if guest.active_assignment.present?
      return ServiceResult.fail("El invitado ya tiene una misión activa.")
    end

    unless mission.active?
      return ServiceResult.fail("La misión está desactivada.")
    end

    if mission.restricted_guests.exists?(guest.id)
      return ServiceResult.fail("Este invitado tiene restricción para esa misión.")
    end

    if MissionAssignment.exists?(mission_id: mission.id)
---
SELECT 1 AS one FROM "mission_assignments" WHERE "mission_assignments"."mission_id" = 1 LIMIT 1

  def self.find_valid_mission_for(guest, exclude_mission_id: nil)
    # IDs of missions where this guest is restricted
    restricted_ids = Mission
      .joins("INNER JOIN guests_missions gm ON gm.mission_id = missions.id")
      .where("gm.guest_id = ?", guest.id)
      .pluck(:id)

    # A mission is unique across all guests, including completed/abandoned history.
    already_assigned_ids = MissionAssignment.distinct.pluck(:mission_id)

    candidates = Mission
      .active
      .where.not(id: restricted_ids)
      .where.not(id: already_assigned_ids)

    candidates = candidates.where.not(id: exclude_mission_id) if exclude_mission_id

    # If no unassigned missions remain, there is no valid mission to assign.
    if candidates.empty?
---
SELECT "missions"."id" FROM "missions" INNER JOIN guests_missions gm ON gm.mission_id = missions.id WHERE (gm.guest_id = 2)
SELECT "mission_assignments"."mission_id" FROM "mission_assignments" WHERE "mission_assignments"."guest_id" = 2
SELECT "missions".* FROM "missions" WHERE "missions"."active" = TRUE AND "missions"."id" != 2 AND 1=1 ORDER BY RANDOM() LIMIT 1
SELECT 1 AS one FROM "missions" WHERE "missions"."active" = TRUE AND "missions"."id" != 2 AND 1=1 LIMIT 1