app/views/guests/index.html.erb

SELECT "guests".* FROM "guests" ORDER BY "guests"."name" ASC
---
          </div>
          <p class="guest-card__name"><%= guest.name.split.first %></p>