app/controllers/admin/dashboard_controller.rb

  def index
    @total_guests      = Guest.count
    @total_missions    = Mission.count
    @active_missions   = Mission.active.count
    @total_assignments = MissionAssignment.count
    @assigned_count    = MissionAssignment.assigned.count
    @completed_count   = MissionAssignment.completed.count
    @abandoned_count   = MissionAssignment.abandoned.count
    @top_guests        = Guest.order(points: :desc, name: :asc).limit(3)
---
SELECT COUNT(*) FROM "guests"
SELECT COUNT(*) FROM "missions"
SELECT COUNT(*) FROM "missions" WHERE "missions"."active" = TRUE
SELECT COUNT(*) FROM "mission_assignments"
SELECT "guests".* FROM "guests" ORDER BY "guests"."points" DESC, "guests"."name" ASC LIMIT 3