app/controllers/admin/guests_controller.rb

SELECT "guests".* FROM "guests" ORDER BY "guests"."name" ASC
---
  def index
    @guests = Guest.order(:name)

INSERT INTO "guests" ("attempts", "created_at", "email", "name", "phone", "picture", "points", "updated_at") VALUES (1, '2026-09-10 12:01:53.594192', 'ags@uc.cl', 'Cheiwi', '', 'https://quo.eldiario.es/wp-content/uploads/2019/10/la-ciencia-descubre-a-que-edad-los-cachorros-son-mas-adorables.jpg.webp', 0, '2026-09-10 12:01:53.594192') RETURNING "id"
---
  def create
    @guest = Guest.new(guest_params)

    if @guest.save

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 4 LIMIT 1
---
  def set_guest
    @guest = Guest.find(params[:id])