app/controllers/admin/mission_assignments_controller.rb

SELECT "guests".* FROM "guests" WHERE "guests"."id" IN (2, 1, 3)
SELECT "missions".* FROM "missions" WHERE "missions"."id" IN (1, 2, 4)
---
  def index
    @assignments = MissionAssignment
      .includes(:guest, :mission)
      .then { |scope| filter_by_status(scope) }
      .order(assigned_at: :desc)

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 4 LIMIT 1
SELECT "missions".* FROM "missions" WHERE "missions"."id" = 1 LIMIT 1
---
  def create
    guest   = Guest.find(assignment_create_params[:guest_id])
    mission = Mission.find(assignment_create_params[:mission_id])

SELECT "guests".* FROM "guests" ORDER BY "guests"."name" ASC
SELECT "missions".* FROM "missions" ORDER BY "missions"."description" ASC
---
  def load_form_data
    @guests   = Guest.order(:name)
    @missions = Mission.order(:description)