app/controllers/admin/missions_controller.rb

SELECT "missions".* FROM "missions" ORDER BY "missions"."description" ASC
---
  def index
    @grouping = %w[score target].include?(params[:group]) ? params[:group] : "none"
    @missions = Mission.includes(:target).order(:description)
    @mission_groups = case @grouping
                      when "score"
                        @missions.group_by(&:score).sort_by { |score, _| -score }
                      when "target"
                        @missions.group_by { |mission| mission.target.name }
                                          .sort_by { |target, _| target }

SELECT "guests".* FROM "guests" WHERE "guests"."id" IN (1, 2, 3)
---
  def show
    @restricted_guests = @mission.restricted_guests.order(:name)
    @target_guests     = @mission.target_guests.order(:name)
    @assignments       = @mission.mission_assignments
                                 .includes(:guest)
                                 .order(assigned_at: :desc)

SELECT "missions".* FROM "missions" WHERE "missions"."id" = 1 LIMIT 1
---
  def set_mission
    @mission = Mission.find(params[:id])

SELECT "guests".* FROM "guests" ORDER BY "guests"."name" ASC
---
  def load_guests
    @all_guests = Guest.order(:name)