app/controllers/admin/ranking_controller.rb

SELECT "guests".* FROM "guests" ORDER BY "guests"."points" DESC, "guests"."name" ASC
---
  def index
    @ranked_guests = Guest.order(points: :desc, name: :asc)