app/views/admin/missions/_form.html.erb

                 value="<%= guest.id %>"
                 <%= "checked" if mission.persisted? && mission.target_guests.include?(guest) %>>
---
SELECT 1 AS one FROM "guests" INNER JOIN "missions_target_guests" ON "guests"."id" = "missions_target_guests"."guest_id" WHERE "missions_target_guests"."mission_id" = 1 AND "guests"."id" = 2 LIMIT 1

                 value="<%= guest.id %>"
                 <%= "checked" if mission.persisted? && mission.restricted_guests.include?(guest) %>>
---
SELECT 1 AS one FROM "guests" INNER JOIN "guests_missions" ON "guests"."id" = "guests_missions"."guest_id" WHERE "guests_missions"."mission_id" = 1 AND "guests"."id" = 2 LIMIT 1