app/views/admin/dashboard/index.html.erb

SELECT COUNT(*) FROM "mission_assignments"
SELECT COUNT(*) FROM "missions"
---
              <p class="admin-list-item__meta">
                <%= guest.mission_assignments.assigned.count %> misión(es) activa(s)