app/views/admin/mission_assignments/index.html.erb

          <div class="avatar avatar--sm admin-list-item__avatar">
            <% if a.guest.picture.present? %>
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" IN (2, 1, 3)