app/views/admin/mission_assignments/new.html.erb

        <%= f.label :guest_id, "Invitado", class: "form-label form-label--required" %>
        <%= f.select :guest_id,
              options_from_collection_for_select(
                @guests, :id, :name,
                params[:guest_id] || @assignment.guest_id
              ),
              { prompt: "Seleccionar invitado…" },
              class: "form-select" %>
---
SELECT "guests".* FROM "guests" ORDER BY "guests"."name" ASC

        <%= f.label :mission_id, "Misión", class: "form-label form-label--required" %>
        <%= f.select :mission_id,
              options_from_collection_for_select(
                @missions.select(&:active?), :id,
                ->(m) { "#{m.description.truncate(60)} (#{m.score} pts)" },
                @assignment.mission_id
              ),
              { prompt: "Seleccionar misión activa…" },
              class: "form-select" %>
---
SELECT "missions".* FROM "missions" ORDER BY "missions"."description" ASC