app/controllers/guest_missions_controller.rb

  def set_guest
    @guest = Guest.find(params[:guest_id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = 2 LIMIT 1