app/controllers/guests_controller.rb

SELECT "guests".* FROM "guests" ORDER BY "guests"."name" ASC
---
  def index
    @guests = Guest.order(:name)

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 2 LIMIT 1
SELECT "mission_assignments".* FROM "mission_assignments" WHERE "mission_assignments"."guest_id" = 2 ORDER BY "mission_assignments"."assigned_at" DESC
---
  def show
    @guest = Guest.find(params[:id])

    # Redirect to verification flow if the guest hasn't been verified this session.
    # Verification stores { verified_guest_id: id, verification_step: 3 } in the session.
    unless verified_as?(@guest)
      redirect_to guest_verification_path(@guest, step: 1) and return
    end

    @active_assignment = @guest.active_assignment
    @current_mission   = @guest.current_mission
    @history           = @guest.mission_assignments
                               .includes(:mission)
                               .order(assigned_at: :desc)