app/controllers/verifications_controller.rb

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 2 LIMIT 1
---
  def set_guest
    @guest = Guest.find(params[:guest_id])